export const QUESTION_1 = 'Question : 兩百字內的個人簡介。'
export const ANSWER_1 =
  'Answer :<br>Hi~ 我是Leona，目前在電商任職的前端工程師，對於後端領域幾乎完全沒有認識。<br>在熟悉前端領域後，漸漸的不滿足於此。<br>本來想試著在工作中轉職成後端，經過嘗試卻發現不太可行。<br>如果目標是轉職後端，相信有一個相較明確的學習 Road map，並能由有後端經驗的導師帶領，比起自己摸索絕對更有效率與深入。<br>基於此，我認為 WeHelp 是市面上最符合我需求的方案，因此前來申請，並希望能有一個機會加入。'

export const QUESTION_2 =
  'Question :<br>為了成為軟體工程師，做過什麼努力？若有具體作品請分享給我們。'
export const ANSWER_2 =
  'Answer :<br>在決定要學習後端的這三個月裡，首先嘗試的是在職內學習，努力的項目包含：API doc 制定、從無到有建立前端 testing 制度、將專案分離成兩個不同網站的 infra 規劃 和 CI 調整。<br>以上都有在公司內部留下教學文件，也都有進入 Production 環境成為正式流程。<br>但後來發現，即使很努力的把所有前端能碰到的後端相關工作都爭取過來，要在職內學習後端還是非常困難，有太多工作無法碰觸的後端知識點，也需要 side project 和練習專案來自己實踐。<br>已提出辭職，會在今年四月份後全職學習後端，目前透過彭彭的 youtube 學習 Python 入門教學課程，跟預習 FastAPI 的官網中。'

export const QUESTION_3 = 'Question : 如果參與這個訓練，會怎麼安排學習時間？'
export const ANSWER_3 =
  'Answer:<br>老實說，關於後端的東西我幾乎都沒有使用經驗，AWS、Python、FastAPI、Docker 等等，課程中關於後端的知識點我幾乎都不會。而前端也有可以更精進的地方，比如我從未用過 TypeScript 等。<br>所以在第一階段的時間，如果是已經會的知識( HTML & CSS )，交出作業後，其餘時間規劃拿去學習補齊可以精進的部分。<br>在教授後端知識時，則是會努力學好學紮實，並盡可能多探索各種應用，和同學交流。<br>期間會辭職全職學習，並去掉所有非運動或程式相關的交際時間。'

export const QUESTION_4 = 'Question : 是否有想要加入的公司？為什麼想加入該公司？'
export const ANSWER_4 =
  'Answer:<br>LINE，很好奇超大流量又包山包海的 LINE server 是如何設計，也期許自己能在三年內可以有機會到國外工作，如果可以到跨國知名公司上班既能滿足好奇心，對履歷也會是很大的幫助。'

export const QUESTION_5 =
  'Question : 請描述一件產生明顯負面情緒的經歷，如何處理該情緒？'
export const ANSWER_5 =
  'Answer:<br>最近大概是意識到自己在工作上嘗試轉職後端是不可行的，而後感受到的挫敗感吧。以為可以，也很努力，結果卻不盡人意。<br>如果沒時間，大概就是去買個自己喜歡吃的東西，先讓自己轉移注意力。<br>如果有時間，會想選擇去一個安靜的，有大自然的地方，先什麼都不想的走走路，等心情平復，再想想不行的點什麼，該怎麼解決，並想出相對應的方法。'

export const QUESTION_6 = 'Question : 關於這份申請網頁，分享一個開發時的技術心得。'
export const ANSWER_6 = 'Answer:<br>在做這份 GitHub page 大概遇到兩個問題，其中一個是嘗試用 Next.js 開發 GitHub page 遇到的。<br>因為使用 Next.js 的關係，需要在上版時就先使用 GitHub Actions 把 Next.js build 起來。<br>build 成功之後開始開發需要引用圖片，但卻一直失敗，去看其他人的教學文章也說是一樣的方法，直到最後我直接去看其他人的程式碼，才發現部落格的教學文章跟程式碼根本不相符。<br>果然還是程式碼最可靠，直接去看程式碼吧。'

export const QUESTION_7 =
  'Question :<br>請用簡短兩三句話，描述對你而言，最重要的一項人際交往原則。'
export const ANSWER_7 =
  'Answer:<br>「幸運會眷顧努力的人」<br>對我來說，努力與真誠大概是我最看重的吧。<br>大部分人的天生能力是鐘型曲線，真正天生的天才與笨蛋並沒有那麼多，更多是處事態度的一點點累積而形成的差距。<br>所以待人真誠、盡力而為，才是讓人更出挑的重點。'

export const QUESTION_8 = 'Question : 其他想要對我們說的事情？'
export const ANSWER_8 =
  'Answer:<br>我知道我不是課程想象中的目標客群。<br>我有一定的經驗，老師會擔心我是否有想清楚，是否能得到所想要的。<br>想說的是，我其實就是想要一個資深導師，一些可以討論的對象，一個可以成為後端工程師的 Road map。<br><br>並且我也不只是想要單純轉職成後端工程師，我更想成為的是，上完這個課程後，在上過這個課程的所有學生中，有史以來最厲害，薪水最高的工程師。<br>而且現在市面上相對來說，前端轉職後端的相關資訊較少，如果是在職想要學習後端的前端，其實會受到職位、時間、跟他人討論學習時，則會受到刻板印象的影響。全職學習後端又會只剩下自己一個人孤軍奮戰。前端想要轉職成後端的難度其實不低......<br>如果我成功了，相信可以給跟我一樣掙扎前進的前端們一個鼓舞！一個如果想學習後端，你也可以不是一個人的希望與方向！<br><br>所以儘管知道我不是完美 TA，還是想來嘗試是否可以給我一個機會，看看上完課程後，我可以到什麼樣的程度，得到什麼樣的 offer，變成什麼樣的工程師。<br>謝謝彭彭團隊你們耐心的閱讀，希望可以在課程中遇到你們：）'